KHIEM2812/auto_quad_fc/stm32_pmsm_foc/System & drive params/Parameters conversion.h
/**
  ******************************************************************************
  * @file    Parameters conversion.h
  * @author  IMS Systems Lab and Technical Marketing - MC Team
  * @version 3.0
  * @date    05-Apr-2011 11:34
  * @brief   This file contains motor parameters needed by STM32 PMSM MC FW  
  *	         library v3.0
  ******************************************************************************
  * <br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  */
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PARAMETERS_CONVERSION_H
#define __PARAMETERS_CONVERSION_H

#include "Definitions.h"
#include "PMSM motor parameters.h"
#include "Drive parameters.h"
#include "Power stage parameters.h"
#include "Control stage parameters.h"
#include "stm32f10x.h"

#define SQRT_2  1.4142
#define SQRT_3  1.732

/************************* CPU & ADC PERIPHERAL CLOCK CONFIG ******************/

#ifdef CPU_CLK_72_MHZ
#define SYSCLK_FREQ_72MHz  72000000uL
#define ADC_CLOCK_DIVIDER  RCC_PCLK2_Div6
#define ADV_TIM_CLK_MHz    72uL
#define ADC_CLK_MHz        12uL
#define HALL_TIM_CLK       SYSCLK_FREQ_72MHz

#elif defined CPU_CLK_56_MHZ
#define SYSCLK_FREQ_56MHz  56000000uL
#define ADC_CLOCK_DIVIDER  RCC_PCLK2_Div4
#define ADV_TIM_CLK_MHz    56uL
#define ADC_CLK_MHz        14uL
#define HALL_TIM_CLK       SYSCLK_FREQ_56MHz

#elif defined CPU_CLK_48_MHZ
#define SYSCLK_FREQ_48MHz  48000000uL
#define ADC_CLOCK_DIVIDER  RCC_PCLK2_Div4
#define ADV_TIM_CLK_MHz    48uL
#define ADC_CLK_MHz        12uL
#define HALL_TIM_CLK       SYSCLK_FREQ_48MHz

#elif defined CPU_CLK_24_MHZ
#define SYSCLK_FREQ_24MHz  24000000uL
#define ADC_CLOCK_DIVIDER  RCC_PCLK2_Div2
#define ADV_TIM_CLK_MHz    24uL
#define ADC_CLK_MHz        12uL
#define HALL_TIM_CLK       SYSCLK_FREQ_24MHz
#else
#endif

#define ADC1_2  ADC1
/************************* CONTROL FREQUENCIES & DELAIES **********************/
#define TF_REGULATION_RATE 	(uint16_t) ((uint16_t)(PWM_FREQUENCY)/REGULATION_EXECUTION_RATE)
#define REP_COUNTER 			(uint16_t) ((REGULATION_EXECUTION_RATE *2u)-1u)

#define MEDIUM_FREQUENCY_TASK_RATE	(uint16_t)SPEED_LOOP_FREQUENCY_HZ

#define INRUSH_CURRLIMIT_DELAY_COUNTS  (uint16_t)(INRUSH_CURRLIMIT_DELAY_MS * \
                                  ((uint16_t)SPEED_LOOP_FREQUENCY_HZ)/1000u -1u)

#define SYS_TICK_FREQUENCY          2000
#define LF_TASK_FREQUENCY_HZ        100
#define UI_TASK_FREQUENCY_HZ        10
#define SERIAL_COM_TIMEOUT_INVERSE  25

#define MF_TASK_OCCURENCE_TICKS  (SYS_TICK_FREQUENCY/SPEED_LOOP_FREQUENCY_HZ)-1u
#define SAFETY_TASK_OCCURENCE_TICKS 0
#define LF_TASK_OCCURENCE_TICKS  (SYS_TICK_FREQUENCY/LF_TASK_FREQUENCY_HZ)-1u
#define UI_TASK_OCCURENCE_TICKS  (SYS_TICK_FREQUENCY/UI_TASK_FREQUENCY_HZ)-1u
#define SERIALCOM_TIMEOUT_OCCURENCE_TICKS (SYS_TICK_FREQUENCY/SERIAL_COM_TIMEOUT_INVERSE)-1u


/*********************** SENSORLESS REV-UP PARAMETERS *************************/
#define FIRST_SLESS_ALGO_PHASE (ENABLE_SL_ALGO_FROM_PHASE-1u)  

#if OPEN_LOOP_FOC == ENABLE

#define OPEN_LOOP
#undef PHASE1_DURATION
#undef PHASE2_DURATION
#undef PHASE3_DURATION
#undef PHASE4_DURATION
#undef PHASE5_DURATION

#undef PHASE1_FINAL_SPEED_RPM
#undef PHASE2_FINAL_SPEED_RPM
#undef PHASE3_FINAL_SPEED_RPM
#undef PHASE4_FINAL_SPEED_RPM
#undef PHASE5_FINAL_SPEED_RPM

#undef VARIANCE_THRESHOLD
#undef CORD_VARIANCE_THRESHOLD

/* Phase 1 */
#define PHASE1_DURATION		        OPEN_LOOP_SPEED_RAMP_DURATION_MS
#define PHASE1_FINAL_SPEED_RPM	    OPEN_LOOP_SPEED_RPM

/* Phase 2 */
#define PHASE2_DURATION		      65535   /*milliseconds */
#define PHASE2_FINAL_SPEED_RPM	  PHASE1_FINAL_SPEED_RPM

/* Phase 3 */
#define PHASE3_DURATION		       65535   /*milliseconds */
#define PHASE3_FINAL_SPEED_RPM	  PHASE1_FINAL_SPEED_RPM

/* Phase 4 */
#define PHASE4_DURATION		  65535   /*milliseconds */
#define PHASE4_FINAL_SPEED_RPM	  PHASE1_FINAL_SPEED_RPM

/* Phase 5 */
#define PHASE5_DURATION		  65535    /* milliseconds */
#define PHASE5_FINAL_SPEED_RPM	  PHASE1_FINAL_SPEED_RPM

#define VARIANCE_THRESHOLD 0
#define CORD_VARIANCE_THRESHOLD 0

#endif

/************************* OBSERVER + PLL PARAMETERS **************************/
#define MAX_BEMF_VOLTAGE  (u16)((MOTOR_MAX_SPEED_RPM*\
                           MOTOR_VOLTAGE_CONSTANT*SQRT_2)/(1000u*SQRT_3))

#define MOTOR_MAX_SPEED_HZ (s16)((MOTOR_MAX_SPEED_RPM*10u)/60u)

#if (BUS_VOLTAGE_READING == ENABLE)
/*max phase voltage, 0-peak Volts*/
#define MAX_VOLTAGE (int16_t)((MCU_SUPPLY_VOLTAGE/2)/BUS_ADC_CONV_RATIO) 
#else
#define MAX_VOLTAGE (int16_t)(500/2) /* Virtual sensor conversion factor */
#endif

#ifdef ICS_SENSORS 
#define MAX_CURRENT (MCU_SUPPLY_VOLTAGE/(2*AMPLIFICATION_GAIN))
#else
#define MAX_CURRENT (MCU_SUPPLY_VOLTAGE/(2*RSHUNT*AMPLIFICATION_GAIN))
#endif

#define C1 (int32_t)((((int16_t)F1)*RS)/(LS*TF_REGULATION_RATE))
#define C2 (int32_t) GAIN1
#define C3 (int32_t)((((int16_t)F1)*MAX_BEMF_VOLTAGE)/(LS*MAX_CURRENT*TF_REGULATION_RATE))
#define C4 (int32_t) GAIN2
#define C5 (int32_t)((((int16_t)F1)*MAX_VOLTAGE)/(LS*MAX_CURRENT*TF_REGULATION_RATE))

#define MOTOR_MAX_SPEED_DPP (int32_t)((1.2*MOTOR_MAX_SPEED_RPM*65536*POLE_PAIR_NUM)\
                                                            /(TF_REGULATION_RATE*60))

#define FREQ_STARTUP_PWM_STEPS (uint32_t) ((FREQ_START_UP_DURATION * TF_REGULATION_RATE)\
                                                                          /1000u) 
#define FREQ_INC (uint16_t) ((FINAL_START_UP_SPEED*POLE_PAIR_NUM*65536u/60u)\
                                                        /FREQ_STARTUP_PWM_STEPS)
#define I_STARTUP_PWM_STEPS (uint32_t) ((I_START_UP_DURATION * TF_REGULATION_RATE)/1000u) 
#define I_INC (uint16_t)((FINAL_I_STARTUP -FIRST_I_STARTUP)*1024u/I_STARTUP_PWM_STEPS)
#define PERCENTAGE_FACTOR    (uint16_t)(VARIANCE_THRESHOLD*128u)      
#define OBS_MINIMUM_SPEED        (uint16_t) (OBS_MINIMUM_SPEED_RPM/6u)

/*********************** OBSERVER + CORDIC PARAMETERS *************************/
#define CORD_C1 (int32_t)((((int16_t)CORD_F1)*RS)/(LS*TF_REGULATION_RATE))
#define CORD_C2 (int32_t) CORD_GAIN1
#define CORD_C3 (int32_t)((((int16_t)CORD_F1)*MAX_BEMF_VOLTAGE)/(LS*MAX_CURRENT\
                                                           *TF_REGULATION_RATE))
#define CORD_C4 (int32_t) CORD_GAIN2
#define CORD_C5 (int32_t)((((int16_t)CORD_F1)*MAX_VOLTAGE)/(LS*MAX_CURRENT*\
                                                          TF_REGULATION_RATE))
#define CORD_PERCENTAGE_FACTOR    (uint16_t)(CORD_VARIANCE_THRESHOLD*128u)      
#define CORD_MINIMUM_SPEED        (uint16_t) (CORD_MINIMUM_SPEED_RPM/6u)
/**************************   VOLTAGE CONVERSIONS  ****************************/
#define BUS_ADC_CONV_RATIO       VBUS_PARTITIONING_FACTOR

#define OVERVOLTAGE_THRESHOLD_d   (uint16_t)(OV_VOLTAGE_THRESHOLD_V*65535/\
                                  (MCU_SUPPLY_VOLTAGE/VBUS_PARTITIONING_FACTOR))
#define UNDERVOLTAGE_THRESHOLD_d  (uint16_t)((UD_VOLTAGE_THRESHOLD_V*65535)/\
                                  ((uint16_t)(MCU_SUPPLY_VOLTAGE/\
                                                           BUS_ADC_CONV_RATIO)))
#define INT_SUPPLY_VOLTAGE          (uint16_t)(65536/MCU_SUPPLY_VOLTAGE)

#define DELTA_TEMP_THRESHOLD        (OV_TEMPERATURE_THRESHOLD_C- T0_C)
#define DELTA_V_THRESHOLD           (dV_dT * DELTA_TEMP_THRESHOLD)
#define OV_TEMPERATURE_THRESHOLD_d  ((V0_V + DELTA_V_THRESHOLD)*INT_SUPPLY_VOLTAGE)

