KHIEM2812/auto_quad_fc/stm32_pmsm_foc/System & drive params/Parameters conversion.h
#define DELTA_TEMP_HYSTERESIS        (OV_TEMPERATURE_HYSTERESIS_C- T0_C)
#define DELTA_V_HYSTERESIS           (dV_dT * DELTA_TEMP_HYSTERESIS)
#define OV_TEMPERATURE_HYSTERESIS_d  ((V0_V + DELTA_V_HYSTERESIS)*INT_SUPPLY_VOLTAGE)
														  														  
/*************************  PWM IDLE STATES AND POLARITY  *********************/														  
#define H_ACTIVE_HIGH    0x0000u //TIM_OCPolarity_High
#define H_ACTIVE_LOW     0x0002u //TIM_OCPolarity_Low
#define L_ACTIVE_HIGH    0x0000u  //TIM_OCNPolarity_High
#define L_ACTIVE_LOW     0x0008u  //TIM_OCNPolarity_Low 

#define DOUT_ACTIVE_HIGH   DOutputActiveHigh
#define DOUT_ACTIVE_LOW    DOutputActiveLow

#define EMSTOP_ACTIVE_HIGH    TIM_BreakPolarity_High
#define EMSTOP_ACTIVE_LOW     TIM_BreakPolarity_Low

#if (HIGH_SIDE_IDLE_STATE == TURN_OFF)
#if (PHASE_UH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_UH_POLARITY  TIM_OCIdleState_Reset
#else /* PHASE_UH_POLARITY = H_ACTIVE_LOW */
#define IDLE_UH_POLARITY  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_UH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_UH_POLARITY  TIM_OCIdleState_Set
#else /* PHASE_UH_POLARITY = H_ACTIVE_LOW */
#define IDLE_UH_POLARITY  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_IDLE_STATE == TURN_OFF)
#if	(PHASE_VH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_VH_POLARITY  TIM_OCIdleState_Reset
#else /* PHASE_VH_POLARITY = H_ACTIVE_LOW */
#define IDLE_VH_POLARITY  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_VH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_VH_POLARITY  TIM_OCIdleState_Set
#else /* PHASE_VH_POLARITY = H_ACTIVE_LOW */
#define IDLE_VH_POLARITY  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_IDLE_STATE == TURN_OFF)
#if	(PHASE_WH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_WH_POLARITY  TIM_OCIdleState_Reset
#else /* PHASE_WH_POLARITY = H_ACTIVE_LOW */
#define IDLE_WH_POLARITY  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_WH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_WH_POLARITY  TIM_OCIdleState_Set
#else /* PHASE_WH_POLARITY = H_ACTIVE_LOW */
#define IDLE_WH_POLARITY  TIM_OCIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE == TURN_OFF)
#if	(PHASE_UL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_UL_POLARITY  TIM_OCNIdleState_Reset
#else /* PHASE_UL_POLARITY = L_ACTIVE_LOW */
#define IDLE_UL_POLARITY  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_UL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_UL_POLARITY  TIM_OCNIdleState_Set
#else /* PHASE_UL_POLARITY = L_ACTIVE_LOW */
#define IDLE_UL_POLARITY  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE == TURN_OFF)
#if	(PHASE_VL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_VL_POLARITY  TIM_OCNIdleState_Reset
#else /* PHASE_VL_POLARITY = L_ACTIVE_LOW */
#define IDLE_VL_POLARITY  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_VL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_VL_POLARITY  TIM_OCNIdleState_Set
#else /* PHASE_VL_POLARITY = L_ACTIVE_LOW */
#define IDLE_VL_POLARITY  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE == TURN_OFF)
#if	(PHASE_WL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_WL_POLARITY  TIM_OCNIdleState_Reset
#else /* PHASE_WL_POLARITY = L_ACTIVE_LOW */
#define IDLE_WL_POLARITY  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_WL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_WL_POLARITY  TIM_OCNIdleState_Set
#else /* PHASE_WL_POLARITY = L_ACTIVE_LOW */
#define IDLE_WL_POLARITY  TIM_OCNIdleState_Reset
#endif
#endif

#define PWM_TIM1			TIM1
#define PWM_TIM8                        TIM8
#define PWM_NO_REMAP		GPIO_NoRemap_TIM1
#define PWM_FULL_REMAP 		GPIO_FullRemap_TIM1
#define PWM_PARTIAL_REMAP 	GPIO_PartialRemap_TIM1

/**********  AUXILIARY TIMER (SINGLE SHUNT) *************/
#if (defined STM32PERFORMANCELD || defined STM32VALUELD)
#define R1_PWM_AUX_TIM                  TIM3
#else
#define R1_PWM_AUX_TIM                  TIM4
#endif

/**********  SPEED FEEDBACK TIMERS SETTING *************/
#if (HALL_TIMER_SELECTION == HALL_TIM2)
#define HALL_TIMER 				TIM2  
#define HALL_RCC_PERIPHERAL		RCC_APB1Periph_TIM2  
#define HALL_IRQ_CHANNEL  		TIM2_IRQn
#elif (HALL_TIMER_SELECTION == HALL_TIM3)
#define HALL_TIMER 				TIM3  
#define HALL_RCC_PERIPHERAL 	RCC_APB1Periph_TIM3
#define HALL_IRQ_CHANNEL  		TIM3_IRQn  
#elif (HALL_TIMER_SELECTION == HALL_TIM4)
#define HALL_TIMER 				TIM4  
#define HALL_RCC_PERIPHERAL 	RCC_APB1Periph_TIM4  
#define HALL_IRQ_CHANNEL  		TIM4_IRQn
#elif (HALL_TIMER_SELECTION == HALL_TIM5)
#define HALL_TIMER 				TIM5  
#define HALL_RCC_PERIPHERAL 	RCC_APB1Periph_TIM5
#define HALL_IRQ_CHANNEL  		TIM5_IRQn  
#else
#endif

#if (ENC_TIMER_SELECTION == ENC_TIM2)
#define ENC_TIMER 				TIM2  
#define ENC_RCC_PERIPHERAL		RCC_APB1Periph_TIM2  
#define ENC_IRQ_CHANNEL  		TIM2_IRQn
#elif (ENC_TIMER_SELECTION == ENC_TIM3)
#define ENC_TIMER 				TIM3  
#define ENC_RCC_PERIPHERAL 		RCC_APB1Periph_TIM3
#define ENC_IRQ_CHANNEL  		TIM3_IRQn  
#elif (ENC_TIMER_SELECTION == ENC_TIM4)
#define ENC_TIMER 				TIM4  
#define ENC_RCC_PERIPHERAL 		RCC_APB1Periph_TIM4  
#define ENC_IRQ_CHANNEL  		TIM4_IRQn
#elif (ENC_TIMER_SELECTION == ENC_TIM5)
#define ENC_TIMER 				TIM5  
#define ENC_RCC_PERIPHERAL 		RCC_APB1Periph_TIM5
#define ENC_IRQ_CHANNEL  		TIM5_IRQn  
#else
#endif

#if (HALL_ICx_FILTER <= 1)
#define HALL_IC_FILTER   0
#elif (HALL_ICx_FILTER <= 2)
#define HALL_IC_FILTER   1
#elif (HALL_ICx_FILTER <= 6)
#define HALL_IC_FILTER   2
#elif (HALL_ICx_FILTER <= 10)
#define HALL_IC_FILTER   3
#elif (HALL_ICx_FILTER <= 14)
#define HALL_IC_FILTER   4
#elif (HALL_ICx_FILTER <= 20)
#define HALL_IC_FILTER   5
#elif (HALL_ICx_FILTER <= 28)
#define HALL_IC_FILTER   6
#elif (HALL_ICx_FILTER <= 40)
#define HALL_IC_FILTER   7
#elif (HALL_ICx_FILTER <= 56)
#define HALL_IC_FILTER   8
#elif (HALL_ICx_FILTER <= 72)
#define HALL_IC_FILTER   9
#elif (HALL_ICx_FILTER <= 88)
#define HALL_IC_FILTER   10
#elif (HALL_ICx_FILTER <= 112)
#define HALL_IC_FILTER   11
#elif (HALL_ICx_FILTER <= 144)
#define HALL_IC_FILTER   12
#elif (HALL_ICx_FILTER <= 176)
#define HALL_IC_FILTER   13
#elif (HALL_ICx_FILTER <= 224)
#define HALL_IC_FILTER   14
#else
#define HALL_IC_FILTER   15
#endif


#if (ENC_ICx_FILTER <= 1)
#define ENC_IC_FILTER   0
#elif (ENC_ICx_FILTER <= 2)
#define ENC_IC_FILTER   1
#elif (ENC_ICx_FILTER <= 6)
#define ENC_IC_FILTER   2
#elif (ENC_ICx_FILTER <= 10)
#define ENC_IC_FILTER   3
#elif (ENC_ICx_FILTER <= 14)
#define ENC_IC_FILTER   4
#elif (ENC_ICx_FILTER <= 20)
#define ENC_IC_FILTER   5
#elif (ENC_ICx_FILTER <= 28)
#define ENC_IC_FILTER   6
#elif (ENC_ICx_FILTER <= 40)
#define ENC_IC_FILTER   7
#elif (ENC_ICx_FILTER <= 56)
#define ENC_IC_FILTER   8
#elif (ENC_ICx_FILTER <= 72)
#define ENC_IC_FILTER   9
#elif (ENC_ICx_FILTER <= 88)
#define ENC_IC_FILTER   10
#elif (ENC_ICx_FILTER <= 112)
#define ENC_IC_FILTER   11
#elif (ENC_ICx_FILTER <= 144)
#define ENC_IC_FILTER   12
#elif (ENC_ICx_FILTER <= 176)
#define ENC_IC_FILTER   13
#elif (ENC_ICx_FILTER <= 224)
#define ENC_IC_FILTER   14
#else
#define ENC_IC_FILTER   15
#endif
/*************** Encoder Alignemnt ************************/
    
