KHIEM2812/auto_quad_fc/stm32_pmsm_foc/System & drive params/Parameters conversion.h
#if (FLUX_WEAKENING_ENABLING == ENABLE)
#define FLUX_WEAKENING
#endif

#if defined AUX_ENCODER
#define VIEW_ENCODER_FEEDBACK
#endif

#if defined AUX_HALL_SENSORS
#define VIEW_HALL_FEEDBACK
#endif

#if (DAC_FUNCTIONALITY == DISABLE)
#undef DAC_FUNCTIONALITY
#endif

#if (SERIAL_COMMUNICATION == DISABLE)
#undef SERIAL_COMMUNICATION
#endif

/* Number of MC object */

#ifdef SINGLEDRIVE
  #define MC_NUM 1
#endif

#ifdef DUALDRIVE
  #define MC_NUM 2
#endif

#if (defined(SINGLE_SHUNT) || defined(THREE_SHUNT))
#define PQD_CONVERSION_FACTOR (int32_t)(( 1000 * 3 * MCU_SUPPLY_VOLTAGE ) /\
             ( 1.732 * RSHUNT * AMPLIFICATION_GAIN ))
#endif

#if (defined(ICS_SENSORS))
#define PQD_CONVERSION_FACTOR (int32_t)(( 1000 * 3 * MCU_SUPPLY_VOLTAGE ) /\
             ( 1.732 * AMPLIFICATION_GAIN ))
#endif

/****** Prepares the UI configurations according the MCconfxx settings ********/
#ifdef LCD_FUNCTIONALITY
  #define LCD_ENABLE |OPT_LCD
#else
  #define LCD_ENABLE 
#endif

#ifdef SERIAL_COMMUNICATION
  #define COM_ENABLE |OPT_COM
#else
  #define COM_ENABLE
#endif

#ifdef DAC_FUNCTIONALITY
  #ifdef STM32VALUE
    #define DAC_ENABLE |OPT_DAC
  #endif
  #ifdef STM32PERFORMANCE
    #define DAC_ENABLE |OPT_DACT
  #endif
  #ifdef STM32HD
    #define DAC_ENABLE |OPT_DAC
  #endif
  #define DAC_OP_ENABLE |UI_CFGOPT_DAC
#else
  #define DAC_ENABLE
  #define DAC_OP_ENABLE
#endif

/* Motor 1 settings */
#ifdef FLUX_WEAKENING
  #define FW_ENABLE |UI_CFGOPT_FW
#else
  #define FW_ENABLE
#endif

#ifdef DIFFERENTIAL_TERM_ENABLED
  #define DIFFTERM_ENABLE |UI_CFGOPT_SPEED_KD|UI_CFGOPT_Iq_KD|UI_CFGOPT_Id_KD
#else
  #define DIFFTERM_ENABLE
#endif

/* Sensors setting */
#ifdef STATE_OBSERVER_PLL
  #define MAIN_SCFG UI_SCODE_STO_PLL
#endif

#ifdef STATE_OBSERVER_CORDIC
  #define MAIN_SCFG UI_SCODE_STO_CR
#endif

#ifdef AUX_STATE_OBSERVER_PLL
  #define AUX_SCFG UI_SCODE_STO_PLL
#endif

#ifdef AUX_STATE_OBSERVER_CORDIC
  #define AUX_SCFG UI_SCODE_STO_CR
#endif

#ifdef ENCODER
  #define MAIN_SCFG UI_SCODE_ENC
#endif

#ifdef VIEW_ENCODER_FEEDBACK
  #define AUX_SCFG UI_SCODE_ENC
#endif

#ifdef HALL_SENSORS
  #define MAIN_SCFG UI_SCODE_HALL
#endif

#ifdef VIEW_HALL_FEEDBACK
  #define AUX_SCFG UI_SCODE_HALL
#endif

#ifndef AUX_SCFG
#define AUX_SCFG 0x0
#endif

#if defined(PLLTUNING)
  #define PLLTUNING_ENABLE |UI_CFGOPT_PLLTUNING
#else
  #define PLLTUNING_ENABLE
#endif

/******************************************************************************* 
  * UI configurations settings. It can be manually overwritten if special 
  * configuartion is required. 
*******************************************************************************/

/* Base configuration of UI */
#define UI_INIT_CFG ( OPT_NONE LCD_ENABLE COM_ENABLE DAC_ENABLE )

/* Specific options of UI */
#define UI_CONFIG_M1 ( UI_CFGOPT_NONE DAC_OP_ENABLE FW_ENABLE DIFFTERM_ENABLE \
  | (MAIN_SCFG << MAIN_SCFG_POS) | (AUX_SCFG << AUX_SCFG_POS) | UI_CFGOPT_SETIDINSPDMODE PLLTUNING_ENABLE | UI_CFGOPT_PLLTUNING)

#ifdef SINGLEDRIVE
  #define UI_CONFIG_M2
#endif


/* Below Function prototype definitions can be removed adding the inclusion of 
Timebase.h in stm32f10x_MC_it.c */
void TB_SerialCommunicationTimeOutStop(void);
void TB_SerialCommunicationTimeOutStart(void);

#endif /*__PARAMETERS_CONVERSION_H*/

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
